read_verilog moduloFinal.v

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

simplemap

write_verilog moduloFinal_synth.v
clean

