
read_verilog contador.v

hierarchy -check -top contador

proc;  fsm;  memory

techmap

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

clean

write_verilog contador_s.v
